{"limit":10,"skip":0,"numPages":2,"currentPage":1,"posts":[{"id":"c8f2deb0-71b0-5619-a7d2-1f467ce4e2e4","slug":"/2020-08-30-etc-aws-route-53/","excerpt":"AWS Route 53 높은 가용성과 확장성이 뛰어난 클라우드 Domain Name System (DNS) 웹 서비스. 일반적인 DNS 기능 + 모니터링 기능 + 서버 로드 밸런싱 기능 + 글로벌 서버 로드 밸런싱 기능을 제공한다. DNS (Domain Name System): 네트워크에 연결된 호스트들은 각각 IP 주소들을 가지고 있다. 이 IP 주소는…","title":"AWS 도메인 설정","date":"2020년 08월 30일"},{"id":"d8f2deb7-330f-5656-b017-a18594307d2c","slug":"/2020-07-26-etc-aws-s3-hosting/","excerpt":"AWS S3 AWS S3(Simple Storage Service)는 인터넷상 어디서나 원하는 양의 데이터를 저장하고 검색할 수 있도록 구축된 객체 스토리지 서비스이다. 확장성과 가용성이 뛰어나며 모든 S3 객체의 복사본을 자동으로 생성하고 저장하기 때문에 높은 내구성을 보장한다. 사용한 스토리지 만큼 요금이 청구된다. 객체 S3에 저장되는 기본 개체. …","title":"React 프로젝트 AWS S3, CloudFront에 배포하기","date":"2020년 07월 26일"},{"id":"e9c3b10e-6f1a-5cfb-88cd-13fb37376aaa","slug":"/2020-07-25-etc-aws-iam-security/","excerpt":"저번에 IAM이 뭔지 알아보면서 IAM 사용자 추가 작업까지 한 후 IAM 보안 상태가 있다는걸 확인했다. 필수로 설정하지 않아도 되는 항목이라 이것까지 알아야될 필요가 있을까 싶었는데 좀 더 AWS를 안전하고 제대로 사용하려면 알고 있는게 나을거 같아서 항목 하나 하나씩 제대로 알아보기로 했다.  IAM 대시보드 창에 접속하면 IAM 보안 상태를 확인할…","title":"AWS IAM 보안","date":"2020년 07월 25일"},{"id":"84b4c21e-0ad4-5343-9235-fe0d1ac6f659","slug":"/2020-07-19-etc-aws-iam/","excerpt":"AWS IAM AWS 리소스에 대한 액세스를 안전하게 제어할 수 있는 웹 서비스. AWS 계정 안에 IAM 그룹과 사용자를 생성하여 접근제어 및 권한관리를 세분화 할 수 있다. 일부 EC2 인스턴스를 관리할 수 있는 권한을 주거나, 일부 S3 버킷에 대한 읽기 전용 권한만 주는 등 리소스에 따라 여러 사람에게 다양한 권한을 부여할 수 있다. IAM 사용자…","title":"AWS IAM 및 IAM 사용자 추가하기","date":"2020년 07월 19일"},{"id":"05175fe6-547a-54ad-9f96-e37b3853cdaf","slug":"/2020-07-18-etc-cloude-computer/","excerpt":"클라우드 컴퓨팅 플랫폼, 서버, 애플리케이션 등의 IT 리소스를 인터넷을 통해 온디맨드로 제공하고 사용한 만큼만 비용을 지불하는 서비스. 확장 가능하고 측정된 IT 리소스를 원격으로 프로비저닝 하기 위해 설계된 IT 환경. 사용자는 필요한 자원을 클라우드에 요청할 뿐, 물리적인 컴퓨터를 구성하거나 구입할 필요가 없다. 온디맨드: 모바일을 포함한 정보통신기…","title":"클라우드 컴퓨팅","date":"2020년 07월 18일"},{"id":"05cc2345-2a1a-590e-ab46-c79d89790232","slug":"/2020-04-01-etc-redux/","excerpt":"Redux란? Redux는 JavaScript App을 위한 상태관리 라이브러리 이다. 글로벌 상태 관리를 할 때 굉장히 효과적이다. 주로 React에서 글로벌 상태 관리를 위해 많이 사용하나 React가 아닌 다른 JavaScript 라이브러리에서도 사용 가능하다.  예를 들어서 A 컴포넌트에 상태 변화가 일어났을 때 B 컴포넌트에도 바뀐 상태가 변경이…","title":"Redux","date":"2020년 04월 01일"},{"id":"ef8adc92-e08a-57e8-ac96-ee38f65b44e0","slug":"/2020-03-18-json-web-token/","excerpt":"JWT(Json Web Token) 두 개체 간의 정보를 안전하게 JSON 객체로 전송하기 위한 간결하고 독립적인 방법을 정의하는 개방형 표준(RFC 7519) 정보는 디지털 서명이 되어 있기 때문에 신뢰할 수 있다. HMAC 알고리즘을 사용한 비밀키 또는 RAS이나 ECDSA를 사용하는 공개 / 개인키 쌍을 사용하여 서명할 수 있다. 언제 JWT를 사용…","title":"JWT(Json Web Token)","date":"2020년 03월 18일"},{"id":"78109ec7-baa7-5865-b863-1c21294911db","slug":"/2020-03-16-etc-token/","excerpt":"세션기반 인증 방식 세션 일정시간 동안 같은 사용자로부터 들어오는 일련의 요구를 하나의 상태로 보고 그 상태를 일정하기 유지시키는 기술. 일정시간이란 방문자가 클라이언트를 통해 서버에 접속한 시점으로부터 방문자가 클라이언트를 종료함으로써 연결을 끝내는 시점. 세션 기반 인증 방식 FLOW 사용자가 로그인을 한다. 사용자가 입력한 로그인 정보를 서버로 전달…","title":"세션 기반 인증 방식과 토큰 인증 방식","date":"2020년 03월 16일"},{"id":"ff881a2e-5eee-54a3-9123-64e38a79a8c2","slug":"/2019-12-30-etc-2019-memoir/","excerpt":"또 한해가 끝나간다. 특히 12월은 더 빠르게 지나가는 것 같다. 2020년을 맞이하기 전 2019년을 한번 돌아보자. 이직 올해의 가장 큰 변화는 이직이다. 번아웃이 너무 심하게 찾아와 잠시 방황을 하다가 결국 그만두는게 맞다는 결론을 내리고 회사를 그만 두었는데 이때의 방황이 같이 일했던 팀원들에게 폐가 된 것 같아서 너무 죄송스럽다. 다음번에 번아웃…","title":"2019년 회고록","date":"2019년 12월 30일"},{"id":"d64ab2b4-4901-5197-acc9-095227733f69","slug":"/2019-07-21-blog-migration-2/","excerpt":"Hexo에서 Gatsby로 블로그 마이그레이션 작업을 계속 이어 하면서 과정을 한번 더 정리 하였다. 직접 이것 저것 원하는대로 다 커스터마이징 하려다 보니 끝이 없는 것 같다 ㅠ. disqus 댓글은 disqus를 사용했다. utterances도 고려해봤는데 github 아이디가 있어아만 댓글을 쓸 수 있다는 점이 단점으로 느껴져서 그냥 disqus를 …","title":"Hexo 에서 Gatsby로 블로그 마이그레이션 하기 2","date":"2019년 07월 21일"}]}