{"limit":10,"skip":0,"numPages":2,"currentPage":1,"posts":[{"id":"05cc2345-2a1a-590e-ab46-c79d89790232","slug":"/2020-04-01-etc-redux/","excerpt":"Redux란? Redux는 JavaScript App을 위한 상태관리 라이브러리 이다. 글로벌 상태 관리를 할 때 굉장히 효과적이다.\n주로 React에서 글로벌 상태 관리를 위해 많이 사용하나 React가 아닌 다른 JavaScript 라이브러리에서도 사용 가능하다.  예를 들어서 A 컴포넌트에 상태 변화가 일어났을 때 B 컴포넌트에도 바뀐 상태가 변경이…","title":"Redux","date":"2020년 04월 01일"},{"id":"ef8adc92-e08a-57e8-ac96-ee38f65b44e0","slug":"/2020-03-18-json-web-token/","excerpt":"JWT(Json Web Token) 두 개체 간의 정보를 안전하게 JSON 객체로 전송하기 위한 간결하고 독립적인 방법을 정의하는 개방형 표준(RFC 7519) 정보는 디지털 서명이 되어 있기 때문에 신뢰할 수 있다. HMAC 알고리즘을 사용한 비밀키 또는 RAS이나 ECDSA를 사용하는 공개 / 개인키 쌍을 사용하여 서명할 수 있다. 언제 JWT를 사용…","title":"JWT(Json Web Token)","date":"2020년 03월 18일"},{"id":"78109ec7-baa7-5865-b863-1c21294911db","slug":"/2020-03-16-etc-token/","excerpt":"세션기반 인증 방식 세션 일정시간 동안 같은 사용자로부터 들어오는 일련의 요구를 하나의 상태로 보고 그 상태를 일정하기 유지시키는 기술. 일정시간이란 방문자가 클라이언트를 통해 서버에 접속한 시점으로부터 방문자가 클라이언트를 종료함으로써 연결을 끝내는 시점. 세션 기반 인증 방식 FLOW 사용자가 로그인을 한다. 사용자가 입력한 로그인 정보를 서버로 전달…","title":"세션 기반 인증 방식과 토큰 인증 방식","date":"2020년 03월 16일"},{"id":"ff881a2e-5eee-54a3-9123-64e38a79a8c2","slug":"/2019-12-30-etc-2019-memoir/","excerpt":"또 한해가 끝나간다. 특히 12월은 더 빠르게 지나가는 것 같다. 2020년을 맞이하기 전 2019년을 한번 돌아보자. 이직 올해의 가장 큰 변화는 이직이다. 번아웃이 너무 심하게 찾아와 잠시 방황을 하다가 결국 그만두는게 맞다는 결론을 내리고 회사를 그만 두었는데 이때의 방황이 같이 일했던 팀원들에게 폐가 된 것 같아서 너무 죄송스럽다. 다음번에 번아웃…","title":"2019년 회고록","date":"2019년 12월 30일"},{"id":"d64ab2b4-4901-5197-acc9-095227733f69","slug":"/2019-07-21-blog-migration-2/","excerpt":"Hexo에서 Gatsby로 블로그 마이그레이션 작업을 계속 이어 하면서 과정을 한번 더 정리 하였다. 직접 이것 저것 원하는대로 다 커스터마이징 하려다 보니 끝이 없는 것 같다 ㅠ. disqus 댓글은 disqus를 사용했다. utterances도 고려해봤는데 github 아이디가 있어아만 댓글을 쓸 수 있다는 점이 단점으로 느껴져서 그냥 disqus를 …","title":"Hexo 에서 Gatsby로 블로그 마이그레이션 하기 2","date":"2019년 07월 21일"},{"id":"274de073-9a02-5ce8-8711-248845983818","slug":"/2019-07-04-blog-migration/","excerpt":"이번 주 내내 Hexo로 만든 블로그를 Gatsby로 마이그레이션 하는 작업을 했다. Hexo도 나름 편했지만 테마를 원하는 대로 새로 만들거나 커스터마이징 하기 좀 어렵다는 단점이 있었다. 그러다가 6월 말에 갔던 컨퍼런스에서 몇몇 연사자 분들이 Gatsby.js를 언급하셔서 관심이 생겨 한번 찾아보았다. React.js, GraphQL 등을 사용하여 …","title":"Hexo 에서 Gatsby로 블로그 마이그레이션 하기","date":"2019년 07월 04일"},{"id":"9a5ace62-8564-5657-82e9-9e7dd8ecb1e9","slug":"/2019-06-26-front-end-endgame-review/","excerpt":"시험이 저번주 일요일에 끝나서 이제야 후기를 적는다. 친구가 어디서 봤는지 이런 컨퍼런스가 있다고 같이 가자며 GDG FRONT-ENDGAME 컨퍼런스 festa 링크를 공유해줬다. 컨퍼런스를 안간지 좀 되서 부지런하게 살 겸 오랜만에 가볼까 하며 컨퍼런스 소개글을 읽고 있는데 발표자에 'Velopert'님이 있는걸 보고 아 이건 꼭 가야겠다고 마음을 먹…","title":"GDG FRONT-ENDGAME 컨퍼런스 후기","date":"2019년 06월 26일"},{"id":"9789d498-e510-59ec-8278-33af61198cdc","slug":"/2018-12-31-2018-memoir/","excerpt":"시간이 참 빨리간다. 눈 몇번 깜빡하고 나니까 벌써 2018년이 지나갔다 ㅠ.\n2019년을 맞이하기 전 2018년을 한번 돌아보자. 올해 잘한 일 방송통신대에 3학년으로 편입해서 1학기, 2학기를 보냈다.\n전문학사가 아쉬워서 학사를 따야지, 따야지 하다가 더 미루면 안될것 같아 눈 딱 감고 편입을 했다. 회사일과 학교공부를 동시에 하는게 좀 힘들었지만 그…","title":"2018년 회고록","date":"2018년 12월 31일"},{"id":"2c653b66-580d-5ff3-8b87-ef12d67d49e4","slug":"/2018-09-28-reactjs-props/","excerpt":"props props는 Component 속성을 설정할 때 사용하는 요소이다. Component는 props를 받고 props의 값에 따라 다르게 렌더링 하거나 작동할 수 있다.\nPropTypes 속성의 종류는 React 공식 문서에서 확인할 수 있다. 부모 컴포넌트 props값은 해당 컴포넌트를 불러와 사용하는 부모 컴포넌트에서만 설정할 수 있다. 자식…","title":"props","date":"2018년 09월 28일"},{"id":"a0e2403d-68f6-5d1b-85f7-38347ec8fcf6","slug":"/2018-08-11-html-email-templete/","excerpt":"오랜만에 퍼블리싱 외주를 받았는데 이메일 템플릿을 퍼블리싱 하는 일이었다.\n이메일 템플릿은 처음 퍼블리싱 해보는거라 작업 전 먼저 사전작업으로 리서치나 관련 정보들을 알아봤다. 리서치 먼저 내가 받은 이메일 중 몇몇 이메일을 검사해 보았다. \n\n대부분은 table로 레이아웃을 잡고 퍼블리싱을 했다. \n\n평범하게 div를 사용해서 레이아웃을 잡은 이메일들도…","title":"html 이메일 템플릿 작성하기","date":"2018년 08월 23일"}]}